Revit 2024 API
UIMacroManager.Dispose Method
Releases all resources used by the UIMacroManager
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace